import pikeImg from '../../assets/images/fishes/fish1.png'
import silverCarpImg from '../../assets/images/fishes/fish2.png'
import zanderImg from '../../assets/images/fishes/fish3.png'
import catfishImg from '../../assets/images/fishes/fish4.png'
import bleakImg from '../../assets/images/fishes/fish5.png'
import roachImg from '../../assets/images/fishes/fish6.png'
import breamImg from '../../assets/images/fishes/fish7.png'
import gudgeonImg from '../../assets/images/fishes/fish8.png'
import carpImg from '../../assets/images/fishes/fish9.png'
import aspImg from '../../assets/images/fishes/fish10.png'
import tenchImg from '../../assets/images/fishes/fish14.png'
import crucianCarpImg from '../../assets/images/fishes/fish11.png'
import perchImg from '../../assets/images/fishes/fish13.png'
import ruddImg from '../../assets/images/fishes/fish15.png'
import chubImg from '../../assets/images/fishes/fish17.png'


const fishes = [
  {
    "id": 1,
    "name": "Короп",
    "slug":"carp",
    "description": "Короп — одна з найпопулярніших промислових та спортивних риб. Він відрізняється невибагливістю до умов проживання та швидким зростанням. Тіло коропа вкрите великою лускою, колір якої може варіюватися від золотистого до темно-коричневого. Короп всеїдний, харчується як рослинною, так і тваринною їжею. Зустрічається в річках, озерах та ставках з повільною течією або стоячою водою. Цінується за свої смакові якості та є об'єктом розведення у ставкових господарствах.",
    "fishing_spots": [
      "Старі Кодаки",
      "Коса на Перемозі",
      "Коса навпроти Порохового острову"
    ],
    "imgSrc":carpImg
  },
  {
    "id": 2,
    "name": "Щука",
    "slug":"pike",
    "description": "Щука — типовий хижак прісноводних водойм. У неї витягнуте торпедоподібне тіло, велика голова з видовженою пащею, всіяною гострими зубами. Забарвлення щуки варіюється залежно від середовища проживання, зазвичай зеленувато-сіре з темними поперечними смугами або плямами. Щука — засідковий хижак, що чатує на свою здобич в укриттях. Харчується в основному рибою, але може нападати і на інших дрібних тварин. Є популярним об'єктом спортивної риболовлі.",
    "fishing_spots": [
      "Коса навпроти Порохового острову",
      "Коса на Перемозі",
      "Коса на Червоному Камені"
    ],
    "imgSrc":pikeImg
  },
  {
    "id": 3,
    "name": "Окунь",
    "slug":"perch",
    "description": "Окунь — поширений прісноводний хижак. У нього щільне тіло, вкрите дрібною лускою, та два спинних плавці: один колючий, інший м'який. Забарвлення окуня зеленувато-жовте з темними поперечними смугами. Окунь — активний хижак, харчується дрібною рибою, ракоподібними та комахами. Мешкає в річках, озерах та ставках з чистою водою. Є популярним об'єктом любительської риболовлі.",
    "fishing_spots": [
      "Коса навпроти Порохового острову",
      "Коса на Червоному Камені"
    ],
    "imgSrc":perchImg
  },
  {
    "id": 4,
    "slug":"roach",
    "name": "Плітка",
    "description": "Плітка — мирна зграйна риба, що мешкає у прісноводних водоймах. У неї видовжене тіло, вкрите сріблястою лускою, та червонуваті плавці. Плітка харчується водоростями, водними рослинами, комахами та їх личинками. Віддає перевагу водоймам зі стоячою або повільно текучою водою. Є важливою ланкою в харчовому ланцюгу водойм та популярним об'єктом любительської риболовлі.",
    "fishing_spots": [
      "Коса навпроти Порохового острову",
      "Коса на Перемозі",
      "Коса на Червоному Камені",
      "Комсомольський острів"
    ],
    "imgSrc":roachImg
  },
  {
    "id": 5,
    "name": "Лящ",
    "slug":"bream",
    "description": "Лящ — донна риба, що мешкає в річках та озерах з повільною течією. У нього високе, сплющене з боків тіло, вкрите великою лускою. Колір тіла варіюється від сріблястого до золотистого. Лящ харчується донними організмами, такими як молюски, личинки комах та черв'яки. Є об'єктом промислового та любительського рибальства.",
    "fishing_spots": [
      "Коса на Червоному Камені",
      "Комсомольский острів"
    ],
    "imgSrc":breamImg
  },
  {
    "id": 6,
    "name": "Судак",
    "slug":"zander",
    "description": "Судак — цінна промислова та спортивна риба, що відноситься до хижаків. У нього витягнуте тіло, вкрите дрібною лускою, та два спинних плавці. Забарвлення судака сіро-зелене з темними поперечними смугами. Судак віддає перевагу чистим водоймам з піщаним або кам'янистим дном. Харчується в основному рибою. Цінується за свої смакові якості.",
    "fishing_spots": [
      "Набережна",
      "Коса навпроти Порохового острову"
    ],
    "imgSrc":zanderImg
  },
  {
    "id": 7,
    "name": "Карась",
    "slug":"crucian-carp",
    "description": "Карась — невибаглива до умов проживання прісноводна риба. У нього високе, сплющене з боків тіло, вкрите великою лускою. Колір тіла може варіюватися від сріблястого до золотистого. Карась всеїдний, харчується як рослинною, так і тваринною їжею. Мешкає в стоячих та повільно текучих водоймах, часто в заболочених місцях. Здатний виживати в умовах нестачі кисню.",
    "fishing_spots": [
      "Коса на Перемозі",
      "Коса на Червоному Камені",
      "Комсомольский острів"
    ],
    "imgSrc":crucianCarpImg
  },
  {
    "id": 8,
    "name": "Сом",
    "slug":"catfish",
    "description": "Сом — велика хижа риба, що мешкає у прісноводних водоймах. У нього довге, позбавлене луски тіло, велика голова з вусами та широкий рот. Сом — донний хижак, що веде нічний спосіб життя. Харчується рибою, ракоподібними, молюсками та іншими водними тваринами. Може досягати великих розмірів і є об'єктом спортивної риболовлі.",
    "fishing_spots": [
        "Коса навпроти Порохового острову",
        "Комсомольский острів"
    ],
    "imgSrc":catfishImg
  },
  {
    "id": 9,
    "name": "Жерех",
    "slug":"asp",
    "description": "Жерех — стрімкий хижак, що мешкає в річках зі швидкою течією. У нього видовжене тіло, вкрите дрібною лускою, та потужний хвіст. Жерех полює на поверхні води, переслідуючи дрібну рибу. Є популярним об'єктом спортивної риболовлі завдяки своїй силі та жвавості.",
    "fishing_spots": [
        "Коса навпроти Порохового острову"
    ],
    "imgSrc":aspImg
  },
  {
    "id": 10,
    "name": "Головень",
    "slug":"chub",
    "description": "Головень — прісноводна риба, що мешкає в річках зі швидкою течією та чистою водою. У нього циліндричне тіло, вкрите великою лускою, та широка голова. Головень всеїдний, харчується комахами, ракоподібними, дрібною рибою та рослинною їжею. Є об'єктом любительської риболовлі.",
    "fishing_spots": [
        "Пороховий острів",
        "Коса навпроти Порохового острову"
    ],
    "imgSrc":chubImg
  },
  {
    "id": 11,
    "name": "Лин",
    "slug":"tench",
    "description": "Лин — донна риба, що віддає перевагу стоячим або повільно текучим водоймам з мулистим дном та густою рослинністю. У нього товсте, вкрите слизом тіло та дрібна луска. Лин харчується донними безхребетними та рослинною їжею. Цінується за свої смакові якості.",
    "fishing_spots": [
        "Коса на Червоному Камені"
    ],
    "imgSrc":tenchImg
  },
  {
    "id": 12,
    "name": "Піскар",
    "slug":"gudgeon",
    "description": "Піскар — невелика донна риба, що мешкає в річках та струмках з чистою водою та піщаним або гальковим дном. У нього видовжене тіло, вкрите дрібною лускою, та невеликі вусики біля рота. Піскар харчується донними безхребетними. Є важливою ланкою в екосистемі водойм.",
    "fishing_spots": [
        "Комсомольский острів"
    ],
    "imgSrc":gudgeonImg
  },
  {
    "id": 13,
    "name": "Уклейка",
    "slug":"bleak",
    "description": "Уклейка — невелика зграйна рибка з родини коропових. Вона широко поширена в прісноводних водоймах Європи та Азії. В уклейки видовжене, стиснуте з боків тіло, вкрите дрібною сріблястою лускою. Спина зазвичай темніша, черевце світле. Характерною особливістю уклейки є її невелика голова та верхній рот, пристосований для живлення з поверхні води. Уклейка віддає перевагу триматися у верхніх шарах води, утворюючи великі зграї. Вживається в їжу, наприклад, у в'яленому або смаженому вигляді.",
    "fishing_spots": [
      "Коса навпроти Порохового острову",
      "Коса на Перемозі",
      "Комсомольский острів",
      "Коса на Червоному Камені",
      "Набережна",
      "Старі Кодаки"
    ],
    "imgSrc":bleakImg
  },
  {
    "id": 14,
    "name": "Червонопірка",
    "slug":"rudd",
    "description": "Червонопірка (Scardinius erythrophthalmus) – бажаний трофей для багатьох рибалок-любителів. Свою назву вона отримала за яскраво-червоні плавці, які контрастують із золотистою лускою. Зовні її часто плутають з плотвою, але у червонопірки спинний плавець зміщений далі до хвоста, а очі мають більш жовтий відтінок. Мешкає в стоячих і повільно текучих водоймах з густою водною рослинністю: затоки, стариці, ставки, озера. Тримається в прибережній зоні, серед заростей очерету, рогозу та латаття. Розміри червонопірки зазвичай невеликі: 15-25 см завдовжки і вага до 300-500 грам. Проте зустрічаються і більші екземпляри, що досягають довжини 35-40 см і ваги до 1 кг. М'ясо червонопірки має непогані смакові якості, особливо у смаженому або в'яленому вигляді.",
    "fishing_spots": [
      "Коса навпроти Порохового острову",
      "Коса на Перемозі",
      "Комсомольский острів",
      "Коса на Червоному Камені",
    ],
    "imgSrc":ruddImg
  }
]

export default fishes;
