import spot1Img from '../../assets/images/spots/spot1.jpg'
import spot2Img from '../../assets/images/spots/spot2.jpg'
import spot3Img from '../../assets/images/spots/spot3.jpg'
import spot4Img from '../../assets/images/spots/spot4.jpg'
import spot5Img from '../../assets/images/spots/spot5.jpg'
import spot6Img from '../../assets/images/spots/spot6.jpg'

const spots = [
  {
    "id": 1,
    "name": "Старі Кодаки",
    "slug":"starie-kodaki",
    "description": "Старі Кодаки – це місце з багатою історією, де збереглися залишки старої фортеці. Дніпро тут утворює звивисте русло з перепадами глибин та сильною течією, що приваблює різноманітну рибу. Тут можна зустріти судака, ляща, сома, а також плітку та окуня. Ловля може бути успішною як з берега, так і з човна, з використанням донних снастей та спінінга. Живописні краєвиди та історична атмосфера роблять це місце особливо привабливим для рибалок.",
    "imgSrc":"spot1",
    "imgSrc2": spot1Img,
    "fishId": [1,13]
  },
  {
    "id": 2,
    "name": "Коса на Перемозі",
    "slug":"kosa-pobeda",
    "description": "Коса на Перемозі – популярне місце відпочинку на правому березі Дніпра. Це штучно намита ділянка з піщаним дном та відносно спокійною течією. Тут добре ловиться лящ, карась, плітка, окунь, а також щука та судак. Рибалка можлива як з берега, так і з човна. Завдяки зручному розташуванню та гарній інфраструктурі, це місце користується великою популярністю серед рибалок усіх рівнів підготовки. Влітку тут багато відпочивальників, тому варто обирати час для рибалки, коли людей менше.",
    "imgSrc":"spot2",
    "imgSrc2": spot2Img,
    "fishId": [1,2,4,7,13]
  },
  {
    "id": 3,
    "name": "Коса навпроти Порохового острову",
    "slug":"kosa-porohovoy",
    "description": "Коса навпроти Порохового острова характеризується різноманітним рельєфом дна: тут є і мілководдя, і глибокі ями, а також ділянки з різною течією. Це створює чудові умови для проживання найрізноманітніших видів риб, включаючи щуку, судака, окуня, ляща, плітку, карася, лина і навіть сома. Рибалка тут може бути дуже результативною, особливо при ловлі на спінінг та донні снасті. Місце приваблює рибалок, які віддають перевагу більш диким та відокремленим місцям.",
    "imgSrc":"spot3",
    "imgSrc2": spot3Img,
    "fishId": [1,2,3,4,6,8,9,10,13]
  },
  {
    "id": 4,
    "name": "Коса на Червоному Камені",
    "slug":"kosa-krasniy-kamen",
    "description": "Коса на Червоному Камені розташована в районі з живописними берегами. Дно тут піщане, з перепадами глибин та наявністю течій. Це створює сприятливі умови для ловлі хижої риби, такої як щука, судак, окунь, жерех. Також тут можна зустріти ляща та плітку. Місце популярне серед любителів спінінгової ловлі та ловлі на живця. Красиві пейзажі та можливість спіймати трофейну рибу роблять це місце особливо привабливим.",
    "imgSrc":"spot4",
    "imgSrc2": spot4Img,
    "fishId": [2,3,4,5,7,11,13]
  },
  {
    "id": 5,
    "name": "Комсомольський острів",
    "slug":"comsomolkiy-ostrov",
    "description": "Комсомольський острів, розташований в центрі Дніпра, пропонує різноманітні умови для рибалки. Тут є тихі затоки з повільною течією та ділянки з більш швидкою течією. Залежно від обраного місця можна успішно ловити як мирну рибу (лящ, плітка, карась), так і хижу (щука, окунь, судак). Рибалка можлива як з берега, так і з човна. Острів є популярним місцем відпочинку, тому у вихідні дні тут може бути багато людей.",
    "imgSrc":"spot5",
    "imgSrc2": spot5Img,
    "fishId": [4,5,7,8,12,13]
  },
  {
    "id": 6,
    "name": "Набережна",
    "slug":"naberejnaya",
    "description": "Центральна набережна Дніпра – популярне місце для прогулянок та відпочинку містян. Рибалка тут ведеться, як правило, з бетонних укріплень. Завдяки зручному доступу та близькості до міської інфраструктури, це місце приваблює багатьох рибалок, особливо тих, хто віддає перевагу коротким вилазкам на рибалку після роботи або у вихідні дні. Тут можна спіймати ляща, плітку, окуня, а також бичка та уклейку. Проте варто враховувати, що через інтенсивний рух суден та велику кількість людей, рибалка тут може бути не завжди комфортною.",
    "imgSrc":"spot6",
    "imgSrc2": spot6Img,
    "fishId": [6,13]
  }
]

export default spots;